toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
#include "System.h"
#include "Assert.h"
#include "SystemClock.h"
#include "Startup.h"
#include "MSP430.h"

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
static uint8_t _pixBuf0[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));
static uint8_t _pixBuf1[63*1024] __attribute__((aligned(4))) __attribute__((section(".sram1")));

using namespace STApp;

using EchoMsg = ICE40::EchoMsg;
using EchoResp = ICE40::EchoResp;
using SDClkSrcMsg = ICE40::SDClkSrcMsg;
using SDSendCmdMsg = ICE40::SDSendCmdMsg;
using SDGetStatusMsg = ICE40::SDGetStatusMsg;
using SDGetStatusResp = ICE40::SDGetStatusResp;
using PixResetMsg = ICE40::PixResetMsg;
using PixCaptureMsg = ICE40::PixCaptureMsg;
using PixReadoutMsg = ICE40::PixReadoutMsg;
using PixI2CTransactionMsg = ICE40::PixI2CTransactionMsg;
using PixI2CStatusMsg = ICE40::PixI2CStatusMsg;
using PixI2CStatusResp = ICE40::PixI2CStatusResp;
using PixCaptureStatusMsg = ICE40::PixCaptureStatusMsg;
using PixCaptureStatusResp = ICE40::PixCaptureStatusResp;

using SDRespTypes = ICE40::SDSendCmdMsg::RespTypes;
using SDDatInTypes = ICE40::SDSendCmdMsg::DatInTypes;

System::System() :
// QSPI clock divider=1 => run QSPI clock at 64 MHz
// QSPI alignment=word for high performance transfers
_qspi(QSPI::Mode::Dual, 1, QSPI::Align::Word),
_pixBufs(_pixBuf0, _pixBuf1) {
}

static QSPI_CommandTypeDef _ice40QSPICmd(const ICE40::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
    // When dual-flash quadspi is enabled, the supplied address is
    // divided by 2, so we left-shift `addr` in anticipation of that.
    // But by doing so, we throw out the high bit of `msg`, so we
    // require it to be 0.
    AssertArg(!(b[0] & 0x80));
    
    return QSPI_CommandTypeDef{
        .Instruction = 0xFF,
        .InstructionMode = QSPI_INSTRUCTION_4_LINES,
        
        // When dual-flash quadspi is enabled, the supplied address is
        // divided by 2, so we left-shift `addr` in anticipation of that.
        .Address = (
            (uint32_t)b[0]<<24  |
            (uint32_t)b[1]<<16  |
            (uint32_t)b[2]<<8   |
            (uint32_t)b[3]<<0
        ) << 1,
//            .Address = 0,
        .AddressSize = QSPI_ADDRESS_32_BITS,
        .AddressMode = QSPI_ADDRESS_4_LINES,
        
        .AlternateBytes = (
            (uint32_t)b[4]<<24  |
            (uint32_t)b[5]<<16  |
            (uint32_t)b[6]<<8   |
            (uint32_t)b[7]<<0
        ),
//            .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_32_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_4_LINES,
        
        .DummyCycles = 4,
        
        .NbData = (uint32_t)respLen,
        .DataMode = (respLen ? QSPI_DATA_4_LINES : QSPI_DATA_NONE),
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static void _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg) {
    qspi.command(_ice40QSPICmd(msg, 0));
    qspi.eventChannel.read(); // Wait for the transfer to complete
}

template <typename T>
static T _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg) {
    T resp;
    qspi.read(_ice40QSPICmd(msg, sizeof(resp)), &resp, sizeof(resp));
    qspi.eventChannel.read(); // Wait for the transfer to complete
    return resp;
}

static void _ice40Transfer(QSPI& qspi, const ICE40::Msg& msg, void* resp, size_t respLen) {
    qspi.read(_ice40QSPICmd(msg, respLen), resp, respLen);
    qspi.eventChannel.read(); // Wait for the transfer to complete
}

static void _ice40TransferAsync(QSPI& qspi, const ICE40::Msg& msg, void* resp, size_t respLen) {
    qspi.read(_ice40QSPICmd(msg, respLen), resp, respLen);
}

// Write to entire MSP430 FRAM, and verify that the CRC of written data matches what we expect
void System::init() {
    _super::init();
    _usb.init();
    _qspi.init();
    
    for (;; HAL_Delay(500)) {
        auto s = _msp.connect();
        if (s != _msp.Status::OK) {
            if (s == _msp.Status::JTAGDisabled) {
                s = _msp.erase();
                continue;
            } else {
                abort();
            }
        }
        
        constexpr uint32_t AddrStart = 0xE300;
        constexpr uint32_t AddrEnd = 0xFF80;
        constexpr uint32_t Len = (AddrEnd-AddrStart)/2; // Number of 16-bit words
        
        _msp.memCRCReset();
        _msp.memWrite(AddrStart, (uint16_t*)(0x20010000), Len);
        
        s = _msp.memCRCVerify(AddrStart, (AddrEnd-AddrStart)/2);
        if (s != _msp.Status::OK) {
            abort();
        }
        
        _msp.disconnect();
    }
}

// Toggle GPIOs
//void System::init() {
//    _super::init();
//    _usb.init();
//    _qspi.init();
//    
//    for (;;) {
//        auto s = _msp.connect();
//        if (s != _msp.Status::OK) {
//            if (s == _msp.Status::JTAGDisabled) {
//                s = _msp.erase();
//                continue;
//            } else {
//                abort();
//            }
//        }
//        
//        constexpr uint16_t PM5CTL0  = 0x0130;
//        constexpr uint16_t PAOUT    = 0x0202;
//        constexpr uint16_t PADIR    = 0x0204;
//        constexpr uint16_t PAREN    = 0x0206;
//        constexpr uint16_t PASEL0   = 0x020A;
//        constexpr uint16_t PASEL1   = 0x020C;
//        
//        uint16_t val = 0;
//        
//        // Read PM5CTL0
//        val = _msp.regRead(PM5CTL0);
//        _msp.regWrite(PM5CTL0, 0x0010);
//        val = _msp.regRead(PM5CTL0);
//        
//        // Write PortA.2=1
//        _msp.regWrite(PAOUT, 1<<2);
//        // Set PortA.2 as an output
//        _msp.regWrite(PADIR, 1<<2);
//        
//        val = _msp.regRead(PAOUT);
//        val = _msp.regRead(PADIR);
//        
//        abort();
//        
//        _msp.disconnect();
//        HAL_Delay(500);
//    }
//}




//// Test QSPI
//void System::_handleEvent() {
//    // Confirm that we can communicate with the ICE40
//    {
//        char str[] = "halla";
//        volatile auto status = _ice40Transfer<EchoResp>(_qspi, EchoMsg(str));
//        Assert(!strcmp((char*)status.payload, str));
//    }
//    
//    // Test reading a chunk of data
//    for (;;) {
//        static uint8_t respDataChunk[65532];
//        Msg msg;
//        msg.type = 0x01;
//        _ice40Transfer(_qspi, msg, (void*)respDataChunk, sizeof(respDataChunk));
//        // Confirm the data is what we expect
//        for (size_t i=0; i<sizeof(respDataChunk); i++) {
//            if (!(i % 2))   Assert(respDataChunk[i] == 0x37);
//            else            Assert(respDataChunk[i] == 0x42);
//        }
//    }
//    
//    for (;;);
//}

