toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
void System::_pixI2CRead(uint16_t addr) {
    _ice40Transfer(_qspi, PixI2CTransactionMsg(false, 2, addr, 0));
    
    // Wait for the I2C transaction to complete
    const uint32_t MaxAttempts = 1000;
    for (uint32_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) HAL_Delay(1);
        auto status = _pixI2CStatus();
        _pixStatus.i2cErr = status.err();
        if (_pixStatus.i2cErr) return;
        if (status.done()) {
            _pixStatus.i2cReadVal = status.readData();
            return;
        }
    }
    // Timeout getting response from ICE40
    // This should never happen, since it indicates a Verilog error or a hardware failure.
    abort();
}

void System::_pixI2CWrite(uint16_t addr, uint16_t val) {
    _ice40Transfer(_qspi, PixI2CTransactionMsg(true, 2, addr, val));
    
    // Wait for the I2C transaction to complete
    const uint32_t MaxAttempts = 1000;
    for (uint32_t i=0; i<MaxAttempts; i++) {
        if (i >= 10) HAL_Delay(1);
        auto status = _pixI2CStatus();
        _pixStatus.i2cErr = status.err();
        if (_pixStatus.i2cErr) return;
        if (status.done()) return;
    }
    // Timeout getting response from ICE40
    // This should never happen, since it indicates a Verilog error or a hardware failure.
    abort();
}

ICE40::PixCaptureStatusResp System::_pixCaptureStatus() {
    return _ice40Transfer<PixCaptureStatusResp>(_qspi, PixCaptureStatusMsg());
}



//// Test image capture
//void System::_handleEvent() {
//    // Confirm that we can communicate with the ICE40
//    {
//        char str[] = "halla";
//        auto status = _ice40Transfer<EchoResp>(_qspi, EchoMsg(str));
//        Assert(!strcmp((char*)status.payload, str));
//    }
//    
//    // Assert/deassert pix reset
//    {
//        _ice40Transfer(_qspi, PixResetMsg(false));
//        HAL_Delay(1);
//        _ice40Transfer(_qspi, PixResetMsg(true));
//        // Wait 150k EXTCLK (24MHz) periods
//        // (150e3*(1/24e6)) == 6.25ms
//        HAL_Delay(7);
//    }
//    
//    // Sanity-check pix comms by reading a known register
//    {
//        const uint16_t chipVersion = _pixI2CRead(0x3000);
//        // TODO: we probably don't want to check the version number in production, in case the version number changes?
//        // also the 0x3000 isn't read-only, so in theory it could change
//        Assert(chipVersion == 0x2604);
//    }
//    
//    // Configure internal register initialization
//    {
//        _pixI2CWrite(0x3052, 0xA114);
//    }
//    
//    // Start internal register initialization
//    {
//        _pixI2CWrite(0x304A, 0x0070);
//    }
//    
//    // Wait 150k EXTCLK (24MHz) periods
//    // (150e3*(1/24e6)) == 6.25ms
//    {
//        HAL_Delay(7);
//    }
//    
//    // Enable parallel interface (R0x301A[7]=1), disable serial interface to save power (R0x301A[12]=1)
//    // (Default value of 0x301A is 0x0058)
//    {
//        _pixI2CWrite(0x301A, 0x10D8);
//    }
//    
//    // Set pre_pll_clk_div
//    {
////        _pixI2CWrite(0x302E, 0x0002);  // /2 -> CLK_OP=98 MHz
////        _pixI2CWrite(0x302E, 0x0004);  // /4 -> CLK_OP=49 MHz (Default)
////        _pixI2CWrite(0x302E, 0x003F);  // /63
//    }
//    
//    // Set pll_multiplier
//    {
////        _pixI2CWrite(0x3030, 0x0062);  // *98 (Default)
////        _pixI2CWrite(0x3030, 0x0031);  // *49
//    }
//    
//    // Set vt_pix_clk_div
//    {
////        _pixI2CWrite(0x302A, 0x0006);  // /6 (Default)
////        _pixI2CWrite(0x302A, 0x001F);  // /31
//    }
//    
//    // Set op_pix_clk_div
//    {
////        _pixI2CWrite(0x3036, 0x000A);
//    }
//    
//    // Set output slew rate
//    {
////        _pixI2CWrite(0x306E, 0x0010);  // Slow
////        _pixI2CWrite(0x306E, 0x9010);  // Medium (default)
//        _pixI2CWrite(0x306E, 0xFC10);  // Fast
//    }
//    
//    // Set data_pedestal
//    {
////        _pixI2CWrite(0x301E, 0x00A8);  // Default
////        _pixI2CWrite(0x301E, 0x0000);
//    }
//    
//    // Set test data colors
//    {
////        // Set test_data_red
////        _pixI2CWrite(0x3072, 0x0B2A);  // AAA
////        _pixI2CWrite(0x3072, 0x0FFF);  // FFF
////
////        // Set test_data_greenr
////        _pixI2CWrite(0x3074, 0x0C3B);  // BBB
////        _pixI2CWrite(0x3074, 0x0FFF);  // FFF
////
////        // Set test_data_blue
////        _pixI2CWrite(0x3076, 0x0D4C);  // CCC
////        _pixI2CWrite(0x3076, 0x0FFF);  // FFF
////
////        // Set test_data_greenb
////        _pixI2CWrite(0x3078, 0x0C3B);  // BBB
////        _pixI2CWrite(0x3078, 0x0FFF);  // FFF
//    }
//    
//    // Set test_pattern_mode
//    {
//        // 0: Normal operation (generate output data from pixel array)
//        // 1: Solid color test pattern.
//        // 2: Full color bar test pattern
//        // 3: Fade-to-gray color bar test pattern
//        // 256: Walking 1s test pattern (12 bit)
////        _pixI2CWrite(0x3070, 0x0000);  // Normal operation
////        _pixI2CWrite(0x3070, 0x0001);  // Solid color
////        _pixI2CWrite(0x3070, 0x0002);  // Color bars
////        _pixI2CWrite(0x3070, 0x0003);  // Fade-to-gray
////        _pixI2CWrite(0x3070, 0x0100);  // Walking 1s
//    }
//    
//    // Set serial_format
//    // *** This register write is necessary for parallel mode.
//    // *** The datasheet doesn't mention this. :(
//    // *** Discovered looking at Linux kernel source.
//    {
//        _pixI2CWrite(0x31AE, 0x0301);
//    }
//    
//    // Set data_format_bits
//    // Datasheet:
//    //   "The serial format should be configured using R0x31AC.
//    //   This register should be programmed to 0x0C0C when
//    //   using the parallel interface."
//    {
//        _pixI2CWrite(0x31AC, 0x0C0C);
//    }
//    
//    // Set row_speed
//    {
////        _pixI2CWrite(0x3028, 0x0000);  // 0 cycle delay
////        _pixI2CWrite(0x3028, 0x0010);  // 1/2 cycle delay (default)
//    }
//
//    // Set the x-start address
//    {
////        _pixI2CWrite(0x3004, 0x0006);  // Default
////        _pixI2CWrite(0x3004, 0x0010);
//    }
//
//    // Set the x-end address
//    {
////        _pixI2CWrite(0x3008, 0x0905);  // Default
////        _pixI2CWrite(0x3008, 0x01B1);
//    }
//
//    // Set the y-start address
//    {
////        _pixI2CWrite(0x3002, 0x007C);  // Default
////        _pixI2CWrite(0x3002, 0x007C);
//    }
//
//    // Set the y-end address
//    {
////        _pixI2CWrite(0x3006, 0x058b);  // Default
////        _pixI2CWrite(0x3006, 0x016B);
//    }
//    
//    // Implement "Recommended Default Register Changes and Sequencer"
//    {
//        _pixI2CWrite(0x3ED2, 0x0146);
//        _pixI2CWrite(0x3EDA, 0x88BC);
//        _pixI2CWrite(0x3EDC, 0xAA63);
//        _pixI2CWrite(0x305E, 0x00A0);
//    }
//    
//    // Disable embedded_data (first 2 rows of statistic info)
//    // See AR0134_RR_D.pdf for info on statistics format
//    {
////        _pixI2CWrite(0x3064, 0x1902);  // Stats enabled (default)
//        _pixI2CWrite(0x3064, 0x1802);  // Stats disabled
//    }
//    
//    // Start streaming
//    // (Previous value of 0x301A is 0x10D8, as set above)
//    {
//        _pixI2CWrite(0x301A, 0x10DC);
//    }
//    
//    // Capture a frame
//    for (bool ledOn=true;; ledOn=!ledOn) {
//        _led0.write(ledOn);
//        _ice40Transfer(_qspi, PixCaptureMsg(0));
//        for (int i=0; i<10; i++) {
//            auto status = _pixGetStatus();
//            Assert(!status.capturePixelDropped());
//            if (status.captureDone()) break;
//            Assert(i < 10);
//        }
//        HAL_Delay(33);
//    }
//    
//    for (;;);
//}

void System::_reset(bool usbResetFinish) {
    // Disable interrupts so that resetting is atomic
    IRQState irq;
    irq.disable();
        // Complete USB reset, if the source of the reset was _usb.resetChannel
        if (usbResetFinish) _usb.resetFinish();
        
