toasterllc/MDCCode/Code/STM32/STApp/Source/System.cpp
void System::_pixCapture() {
    Assert(_pixStatus.state == PixState::Idle); // We should only be called while idle
    
    _pixStatus.state = PixState::Capturing;
    
    // Tell ice40 to perform a capture
    _ice40Transfer(_qspi, PixCaptureMsg(0));
    
    // Wait a max of `MaxDelayMs` for the the capture to be ready for readout
    const uint32_t MaxDelayMs = 1000;
    const uint32_t startTime = HAL_GetTick();
    ICE40::PixCaptureStatusResp status;
    for (;;) {
        status = _pixCaptureStatus();
        if (status.done() || (HAL_GetTick()-startTime)>=MaxDelayMs) break;
    }
    
    // If readout isn't ready after our timeout, set our error state for the host to observe
    if (!status.done()) {
        _pixStatus.state = PixState::Error;
        return;
    }
    
    const uint16_t imageWidth = status.imageWidth();
    const uint16_t imageHeight = status.imageHeight();
    
    // Enqueue the PixHeader to be sent over USB
    auto& buf = _pixBufs.writeBuf();
    PixHeader& hdr = *((PixHeader*)buf.data);
    hdr = PixHeader{
        .width = imageWidth,
        .height = imageHeight,
        .highlightCount = status.highlightCount(),
        .shadowCount = status.shadowCount(),
    };
    buf.len = sizeof(PixHeader);
    _pixBufs.writeEnqueue();
    _sendPixDataOverUSB();
    
    // Start readout from ice40
    _pixRemLen = imageWidth*imageHeight*sizeof(Pixel);
    _recvPixDataFromICE40();
}

System Sys;

int main() {
    Sys.init();
    // Event loop
    for (;;) {
        Sys._handleEvent();
    }
    return 0;
}

[[noreturn]] void abort() {
    Sys.abort();
}
